Can't copy element(s) between Model and Annotation families.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId CantCopyBetweenModelAndAnnotFam { get; }
  Visual Basic
Public Shared ReadOnly Property CantCopyBetweenModelAndAnnotFam As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ CantCopyBetweenModelAndAnnotFam {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures CopyPasteFailures Class
  Autodesk.Revit.DB Namespace